#+title: Test

* Test
** execTaskInShellSync
#+name: execTaskInShellSync
#+begin_src lua :exports none
local M = require("utils/command")
-- M.init()
local result
coroutine.create(function ()
    result = M.execTaskInShellSync("yabai -m query --windows", nil, false)
end).yield(3)
print(result)
#+end_src

#+RESULTS: execTaskInShellSync

#+begin_src sh :noweb-prefix no :noweb yes :results output
echo "test execTaskInShellSync"
hs -c '<<execTaskInShellSync>>'
#+end_src

#+RESULTS:
: test execTaskInShellSync
